Fuhrman2010/PorousLayer_boundaryCondition/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosityModel	JensenEtAl2014;

porosityEnabled true;

JensenEtAl2014Coeffs
{
	alpha 500;	//500
	beta 2;		//2	
	gamma_p 0.34;	//0.34
	d50 0.007;
	KC -1;
}

// ************************************************************************* //
