Fuhrman2010/PorousLayer_boundaryCondition/0_org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rbgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedJump;
    patchType       cyclic;
    jump            uniform -0.0882; // uniform -0.00000882;
    value           $internalField;
    }
    outlet
    {
        type            fixedJump;
    patchType       cyclic;
    value           $internalField;
    }
    top
    {
    type  fixedValue;
    value uniform 0;
    }
    walls
    {
    type  zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
